Revit 2025 API
GBXMLExportOptions Constructor
 Constructs a new instance of the options used to export a model in gbXML (green-building) format.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public GBXMLExportOptions()
Public Sub New
public:
GBXMLExportOptions()
new : unit -> GBXMLExportOptions
See Also
Reference
GBXMLExportOptions Class
GBXMLExportOptions Overload
Autodesk.Revit.DB Namespace